Table of Contents
 Class IdeaResult
Namespace
IdeaStatiCa.BimApiLink.Results.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaResult : IIdeaResult
Inheritance
object
IdeaResult
Implements
IIdeaResult
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaResult(ResultLocalSystemType)
public IdeaResult(ResultLocalSystemType coordinateSystemType)
Parameters
coordinateSystemType ResultLocalSystemType
Properties
 CoordinateSystemType
Type of the coordinate system the results are defined in.
public ResultLocalSystemType CoordinateSystemType { get; }
Property Value
ResultLocalSystemType
 Sections
Sections with results.
public IEnumerable<IIdeaSection> Sections { get; }
Property Value
IEnumerable<IIdeaSection>
Methods
 Add(IIdeaSection)
public void Add(IIdeaSection section)
Parameters
section IIdeaSection
 Edit this page